---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemFamilyAndTypeParam
source: html/4e5d1691-9c8d-769b-6b4c-c9822d507c3e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemFamilyAndTypeParam Property

"Family and Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemFamilyAndTypeParam { get; }
```